[
    {
        "speaker": "Lex Fridman",
        "text": "Can you have a conversation with an AI where it feels like you talk to Einstein or Feynman where you ask them a hard question, they're like, \"I don't know.\" And then after a week they did a lot of research- - They disappear and come back. Yeah. - And they come back and just blow your mind. If we can achieve that, that amount of inference compute where it leads to a dramatically better answer as you apply more inference compute, I think that will be the beginning of, like, real reasoning breakthroughs."
    },
    {
        "speaker": "Perplexity CEO",
        "text": "(graphic whooshing) - The following is a conversation with Aravind Srinivas, CEO of Perplexity, a company that aims to revolutionize how we humans get answers to questions on the internet. It combines search and large language models, LLMs, in a way that produces answers where every part of the answer has a citation to human-created sources on the web. This significantly reduces LLM hallucinations and makes it much easier and more reliable to use for research and general, curiosity-driven, late night rabbit hole explorations that I often engage in."
    },
    {
        "speaker": "Lex Fridman",
        "text": "Yeah. A lot more, definitely. I mean but the personalization, there's an 80-20 here. The 80-20 is achieved with your location, let's say you're Jenner, and then, you know, like, sites you typically go to, like a rough sense of topics of what you're interested in. All that can already give you a great personalized experience. It doesn't have to, like, have infinite memory, infinite context windows, have access to every single activity you've done. That's an overkill. - Yeah. Yeah. I mean humans are creatures of habit,"
    },
    {
        "speaker": "Lex Fridman",
        "text": "Exactly. - I mean, I've talked to Karpathy about this and he uses our product, he hates the sidekick, the the side panel. He just wants to be auto hidden all the time. And I think that's good feedback too, because, like, the mind hates clutter. Like when you go into someone's house, you always love it when it's, like, well maintained and clean and minimal. Like there's this whole photo of Steve Jobs, you know, like in this house where it's just, like, a lamp and him sitting on the floor. I always had that vision when designing Perplexity"
    },
    {
        "speaker": "Perplexity CEO",
        "text": "to be as minimal as possible. The original Google was designed like that. That's just literally the logo and the search bar and nothing else. - I mean there's pros and cons to that. I would say in the early days of using a product, there's a kind of anxiety when it's too simple because you feel like you don't know the full set of features, you don't know what to do. - Right. - It almost seems too simple. Like is it just as simple as this? So there's a comfort initially to the sidebar, for example."
    }
]